package com.answertest.data;


public class GraduateData {

	public static final String answerId[]={"1","2","3","4","5","6","7","8","9","10","11","18","13","14","15"};
	public static final String answerName[]={"请介绍你的教育背景情况。","自我介绍主要应该介绍什么？","当和领导的意见不统一时，你会怎么做？"
			,"请介绍你的实习经历情况。","你为什么选择我们公司？","你为什么选择应聘本岗位工作？","你的英语计算机水平怎么样？","你觉得销售人员应该具备哪些能力？"
			,"你认为文职人员需要具备什么样的素质和技能","你认为专业技术人员应具备的基本技能？","请你谈谈你的职业发展规划。","你认为公司管的松一些好还是紧一些好？"
			,"你对薪酬有什么样的要求？","你对公司有哪些要求？","你应聘本岗位的优势是什么？"};

	public static final String answerType[]={"0","0","0","0","0","0","0","1","1","1","0","0","0","1","0"};

	public static final String answerOptionA[]={"介绍学校概况","个人基本情况","绝对地服从"
			," 参加过的社会公益活动","公司规模大，名气大","就是喜欢","一般，还行","具有较强的组织、协调、沟通、领导能力","只要文笔好，能做好眼前工作就行","具备足够的专业知识基础"
			,"我还没有职业发展规划","松好，给员工广阔的发挥空间","当然是越多越好","增加对员工的技术培训","我好像没什么优势，但我保证我能做好"};

	public static final String answerOptionB[]={"解释专业含义","求学的经历"," 当场反驳，不留情面"
			,"列出无论与应聘岗位相关与否的所有实习经历","大量投递，有通知就来面试","大家都这么选择，我也来试试","不好","极强的市场开拓能力，商务谈判及公关能力","踏实肯干，灵活机智"
			,"有技术人员从业资格证书","做好眼前的工作更重要，规划以后再说","无所谓","必须高于行业薪酬水平","能定期涨工资","其他同学都可以，我也可以"};

	public static final String answerOptionC[]={"说出所学的课程","专业技能和优势","表面不谈，背后照旧行事"
			,"说出与应聘岗位相关的实习经历，如实习单位和职位","公司的工资高、福利好","与专业对口","比较好，英语通过四级，计算机二级","出色的人际交往和社会活动能力以及敏锐的洞察力"
			,"有一定的亲和力，有观察力","有一定的工作责任心和抗压能力","我希望5到10年后我在行业里能够达到专业级水平","严好，更好地管理约束员工创造更高的业绩"
			,"按照公司的薪酬水平来制定","实行轮岗作业，不断地制造新鲜感","专业知识扎实，有相关岗位实习经历"};

	public static final String answerOptionD[]={"说明通过学习掌握的专业技能情况","校园生活经历","与领导进一步沟通，表明自己的想法"
			,"说明通过专业性实习所收获的工作经验","一直在关注，看好贵公司的发展前景，希望能够加入"," 其实并不知道自己能做什么，体验、尝试性的工作","很好，已通过等级考试，能在工作中熟练使用"
			,"品行端正、具有亲和力，以及良好的团队协作精神","细致周全，积极上进","熟悉各种设计（或测试）的方法、设计（或检测）标准和正确的操作流程",
			"从基础做起，积累工作经验，再通过培训、进修等方式，不断提升专业技能水平，以达到职业发展的新高度。","适当，既要给员工广阔的发挥空间又要做好管理"
			,"没要求，有工作就行","敢于让新人尝试重要岗位的工作","掌握岗位要求的相关技能，并举例说明"};

	public static final String answerOptionE[]={"性格特点、业余爱好","","不是很关注，不太了解","","","这个岗位能够帮助我更好的实现职业发展目标"
			,"","扎实的文字功底和较强文案的撰写能力","积极配合其他部分的工作","做事有计划，有方案，有原则","","",""," 提供多种员工福利",""};


	public static final String answerAnalysis[]={"推荐选C：介绍个人专业技能和优势是最明智的选择，针对性强，能最直接、最清晰的使HR了解到求职者具备的岗位相关技能，可引起HR继续深入了解的兴趣；"
			,"推荐选 D：很好，能从职业发展的角度阐述离职原因，说明你对自身职业发展已有十分明确的目标和计划，是理智又积极的做出选择，比较容易得到面试官的认可。"
			,"推荐选 D：作为公司员工，在公司需要时可以接受无偿加班，说明你对公司、本职工作融入、接纳的态度，并具有敬业、奉献精神，会受到企业的青睐。"
			,"推荐选 D：目标明确、选择慎重，重视个人与企业的发展性，这是一个能让企业感到欣喜的回答。"
			,"你说呢","哇哈哈哈","我也是醉了","","","","","","","",""};
	public static final String answerScore[]={"8","8","8","8","8","8","8","4","4","4","8","8","8","4","8"};
	public static final String answerCorrect[]={"D","C","D","D","D","E","D","ABCDE","BCDE","BCDE","D","D","C"
			,"CD","D"};

}
