package com.answertest.data;

/**
 * Created by cwj on 2017/5/23.
 */

public class PPTData {
    public static final String question ="\n在PowerPoint 2010中打开考生文件夹下的演示文稿Pt.pptx，完成如下操作：\n" +
            "\n1)\t在第1张幻灯片标题的进入动画设置为“飞入”，效果选项为“自左侧”，持续时间为1.5秒；\n" +
            "\n2)\t将所有幻灯片的主题设置为龙腾四海，背景样式为样式10；\n" +
            "\n3)\t在版式为“标题和内容”的幻灯片母版中插入幻灯片编号，并在左下角添加一个“直角双向箭头”按钮，使放映时点击该按钮链接到幻灯片的首页；\n" +
            "\n4)\t完成后直接保存，并关闭PowerPoint 2010。\n";
    public static final String answer ="解析：\n" +
            "\n打开演示文稿Pt.pptx\n" +
            "\n1)\t选中第一幻灯片，单击标题区，切换到【动画】选项卡，选中【飞入】；单击【效果选项】，选择【自左侧】；持续时间改为1.5秒。\n" +
            "\n2)\t单击【设计】选项卡，在【主题】功能窗口选择“龙腾四海”；单击【背景样式】，选择【样式10】。\n" +
            "\n3)\t单击【视图】选项卡，单击【幻灯片母版】，选中版式为“标题和内容”的幻灯片母版；单击【插入】选项卡|【幻灯片编号】，勾选“幻灯片编号(N)”；单击【插入】|【形状】|【箭头总汇】，选中“直角双向箭头”，于幻灯片母版左下角，按住鼠标左键汇出图形，单击鼠标右键，点选“超链接(H)”|【本文档中的位置】|第一张幻灯片。\n" +
            "\n4)\t单击【保存】\n";
}
